Revit 2027 API
ExternalFileUtils Class
 A utility class containing functions related to external file references.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalFileUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExternalFileUtils
Public NotInheritable Class ExternalFileUtils
public ref class ExternalFileUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalFileUtils = class end
The ExternalFileUtils type exposes the following members.
Methods
Name | Description
GetAllExternalFileReferences |  Gets the ids of all elements which are external file references.
GetExternalFileReference |  Gets the external file referencing data for the given element.
GetFileBasedTempFolder |  Gets a temp folder based on the given file name
IsExternalFileReference |  Determines whether the given element represents an external file.
Top
Remarks
 Elements which are external file references refer to files outside of the base .rvt file. Examples include Revit links, CAD links, the element which stores the location of the keynote file, and rendering decals.
See Also
Reference
Autodesk.Revit.DB Namespace